# Hierarchical Indexing

multiple (two or more) index levels on an axis

In [1]:
import pandas as pd
import numpy as np
data = pd.Series(np.random.randn(9),
                    index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                      [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.918471
   2    2.250722
   3    1.082546
b  1    0.683345
   3   -1.575555
c  1    0.108724
   2    1.403632
d  2   -2.824418
   3   -0.293981
dtype: float64

# partial indexing

In [5]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [2]:
print(data)
data['a']

a  1    0.918471
   2    2.250722
   3    1.082546
b  1    0.683345
   3   -1.575555
c  1    0.108724
   2    1.403632
d  2   -2.824418
   3   -0.293981
dtype: float64

1    0.918471
2    2.250722
3    1.082546
dtype: float64

# inner level selection

In [3]:
data[:,3]

a    1.082546
b   -1.575555
d   -0.293981
dtype: float64

In [15]:
data.unstack()

          1         2         3
a  1.147444  0.857494 -1.418692
b  0.610675       NaN  2.997278
c -1.196236  1.621172       NaN
d       NaN -1.306598  1.299191

In [4]:
# can you put back hierarchical index
data.unstack().stack()

a  1    0.918471
   2    2.250722
   3    1.082546
b  1    0.683345
   3   -1.575555
c  1    0.108724
   2    1.403632
d  2   -2.824418
   3   -0.293981
dtype: float64

# DataFrame

In [5]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                             ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [7]:
frame['Colorado']
#frame['Ohio']

     Green  Red
a 1      0    1
  2      3    4
b 1      6    7
  2      9   10

# Converting columns to index

In [8]:
frame = pd.DataFrame({'a': np.random.randint(0, high =10, size =7), 'b': range(7, 0, -1),
                          'c': ['one', 'one', 'one', 'two', 'two',
                            'two', 'two'],
                      'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  4  7  one  0
1  1  6  one  1
2  6  5  one  2
3  7  4  two  0
4  9  3  two  1
5  3  2  two  2
6  7  1  two  3

In [45]:
frame.set_index(['a', 'b'])

       c  d
a b
7 7  one  0
0 6  one  1
8 5  one  2
5 4  two  0
6 3  two  1
0 2  two  2
5 1  two  3

sorting index

In [50]:
frame.set_index(['a', 'b']).sort_index()

       c  d
a b
0 2  two  2
  6  one  1
5 1  two  3
  4  two  0
6 3  two  1
7 7  one  0
8 5  one  2

In [9]:
# can you revert the hierachical indexing
frame.set_index(['a','b']).sort_index().reset_index()

   a  b    c  d
0  1  6  one  1
1  3  2  two  2
2  4  7  one  0
3  6  5  one  2
4  7  1  two  3
5  7  4  two  0
6  9  3  two  1

# Reordering and Sorting Levels

In [20]:
frame.swaplevel()

     Ohio     Colorado
    Green Red    Green
1 a     0   1        2
2 a     3   4        5
1 b     6   7        8
2 b     9  10       11

# Simple stats

In [19]:
# let's give name to columns
frame.index.names=['k1', 'k2']
frame

ValueError: Length of new names must be 1, got 2

In [16]:
# find the sum based on k2
#frame.sum(level='k2')

ValueError: level name k2 is not the name of the index

# Combining and Merging Datasets
- pandas.merge(SQL join) connects rows in DataFrames based on one or more keys. 
- pandas.concat concatenates or “stacks” together objects along an axis

In [55]:
df1 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                        'data1': range(7)})
df1

   data1 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [56]:
df2 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': range(3)})
df2

   data2 rkey
0      0    a
1      1    b
2      2    d

In [59]:
# inner join
pd.merge(df1, df2, left_on='lkey', right_on='rkey')

   data1 lkey  data2 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

In [60]:
pd.merge(df1, df2, left_on='lkey', right_on='rkey', how='outer')

   data1 lkey  data2 rkey
0    0.0    b    1.0    b
1    1.0    b    1.0    b
2    6.0    b    1.0    b
3    2.0    a    0.0    a
4    4.0    a    0.0    a
5    5.0    a    0.0    a
6    3.0    c    NaN  NaN
7    NaN  NaN    2.0    d